/********************************************************************************
  * @文件名          : main.cpp
  * @作者            : 张凯博
  * @日期            : 2023/5/7
*******************************************************************************/
#include <iostream>
int main() {
    //整型
    int num1=10,num2=20,sum;    //定义整型
    sum=num1+num2;//整型求和
    printf("%d+%d=%d\n",num1,num2,sum);     //输出求和
    //浮点形
    double d1=1.2,d2=2.3,d3;//定义浮点型
    d3=d1+d2;//浮点求和
    printf("%f+%f=%0.3f\n",d1,d2,d3);//浮点数输出
    //字符
    char ch1='a';//定义一个字符
    printf("%c\n",ch1);//输出字符
    printf("%d\n",ch1);//输出字符对应的整数ASCII
    //字符串
    char ch2[4]={'a','s','d','\0'};//第一种字符串定义
    char ch3[4]="asd";//第二种字符串定义
    std::string ch4="zxc";//第三种字符串定义
    printf("%c\n",ch2[2]);//输出字符串中的一个字符
    printf("ch2:%s\n",ch2);//输出字符串ch2
    printf("ch3:%s\n",ch3);//输出字符串ch3
    std::cout<<ch4<<std::endl;//输出字符串ch4
    return 0;
}



